app/controllers/api/v1/contacts_controller.rb

  def index
    render json: Contact.all
---
SELECT "contacts".* FROM "contacts"

  def show
     if Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @contact = Contact.new(contact_params)
    if @contact.save
---
INSERT INTO "contacts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-01-27 17:47:07.288508"], ["updated_at", "2016-01-27 17:47:07.288508"]]

  def update
    @contact = Contact.find(params[:id])
    if @contact.update(contact_params)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "contacts" SET "first_name" = ?, "last_name" = ?, "email" = ?, "phone" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["first_name", "Juan"], ["last_name", "Pere"], ["email", "Jperesz@gmail.com"], ["phone", "1213123123"], ["updated_at", "2016-01-26 20:21:22.681930"], ["id", 2]]

  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 2]]